// 3. Реализовать алгоритм пирамидальной сортировки (HeapSort).
//        На шахматной доске расставить 8 ферзей так, чтобы они не били друг друга.


public class ThirdTask {

    public String [] Chess(){
        for (int i = 0; i < 9; i=i) {
            for (int j = 0; j < 9; j++) {
                System.out.println("-");
                if


            }

        }

    }

}
